Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.github.github_repository.archived["client"] will be updated in-place
~ resource "github_repository" "archived" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + delete_branch_on_merge      = false
      - description                 = "Goboolean 프로젝트의 client 입니다." -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
        id                          = "client"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "client"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + web_commit_signoff_required = false
        # (21 unchanged attributes hidden)
    }

  # module.github.github_repository.archived["command-server"] will be updated in-place
~ resource "github_repository" "archived" {
      ~ archived                    = false -> true
      - description                 = "Goboolean 프로젝트의 Command Server 입니다." -> null
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "command-server"
        name                        = "command-server"
      ~ visibility                  = "public" -> "private"
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.archived["core-system.command"] will be updated in-place
~ resource "github_repository" "archived" {
      ~ archived                    = false -> true
      - description                 = "Goboolean 프로젝트의 command-server 입니다." -> null
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "core-system.command"
        name                        = "core-system.command"
      ~ visibility                  = "public" -> "private"
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.archived["core-system.join"] will be updated in-place
~ resource "github_repository" "archived" {
      ~ archived                    = false -> true
      - description                 = "Goboolean 프로젝트의 query-server 입니다." -> null
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "core-system.join"
        name                        = "core-system.join"
      ~ visibility                  = "public" -> "private"
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.archived["fetch-server.v1"] will be updated in-place
~ resource "github_repository" "archived" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + delete_branch_on_merge      = false
      - description                 = "Goboolean 프로젝트의 stock-fetch-server 입니다." -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "fetch-server.v1"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "fetch-server.v1"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ visibility                  = "public" -> "private"
      + web_commit_signoff_required = false
        # (19 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.archived["fetch-system.master"] will be updated in-place
~ resource "github_repository" "archived" {
      ~ archived                    = false -> true
      - description                 = "Goboolean 프로젝트의 Fetch Server 리포지토리입니다. (deprecated)" -> null
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "fetch-system.master"
        name                        = "fetch-system.master"
        # (30 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.archived["identity-server"] will be updated in-place
~ resource "github_repository" "archived" {
      ~ archived                    = false -> true
      - description                 = "Goboolean 프로젝트의 Identity Server 입니다." -> null
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "identity-server"
        name                        = "identity-server"
      ~ visibility                  = "public" -> "private"
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.archived["manager-cli"] will be updated in-place
~ resource "github_repository" "archived" {
      ~ archived                    = false -> true
      - description                 = "Goboolean 프로젝트의 manager-cli 입니다." -> null
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "manager-cli"
        name                        = "manager-cli"
      ~ visibility                  = "public" -> "private"
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.archived["model-server"] will be updated in-place
~ resource "github_repository" "archived" {
      ~ archived                    = false -> true
      - description                 = "Goboolean 프로젝트의 model-server 입니다." -> null
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "model-server"
        name                        = "model-server"
      ~ visibility                  = "public" -> "private"
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.archived["ops"] will be updated in-place
~ resource "github_repository" "archived" {
      ~ archived                    = false -> true
      - description                 = "Dockerfile, docker-compose.yml, etc" -> null
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
        id                          = "ops"
        name                        = "ops"
        # (31 unchanged attributes hidden)
    }

  # module.github.github_repository.archived["schema-registry"] will be updated in-place
~ resource "github_repository" "archived" {
      ~ archived                    = false -> true
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "schema-registry"
        name                        = "schema-registry"
      ~ visibility                  = "public" -> "private"
      - vulnerability_alerts        = true -> null
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.repository[".github"] will be updated in-place
~ resource "github_repository" "repository" {
      - description                 = "Goboolean 프로젝트입니다." -> null
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = ".github"
        name                        = ".github"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.repository["GoCppLinkingLibrary"] will be updated in-place
~ resource "github_repository" "repository" {
      - description                 = "source code of Goboolean-Worker's Executable Files" -> null
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
        id                          = "GoCppLinkingLibrary"
        name                        = "GoCppLinkingLibrary"
      ~ visibility                  = "private" -> "public"
        # (31 unchanged attributes hidden)
    }

  # module.github.github_repository.repository["airflow-pipeline-factory"] will be created
+ resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "airflow-pipeline-factory"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.github.github_repository.repository["buycycle"] will be updated in-place
~ resource "github_repository" "repository" {
      - description                 = "증권사 API Restful 변환 모듈" -> null
      - has_downloads               = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "buycycle"
        name                        = "buycycle"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.repository["common"] will be updated in-place
~ resource "github_repository" "repository" {
      - description                 = "Goboolean 프로젝트의 shared-packages 입니다." -> null
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "common"
        name                        = "common"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.repository["core-system.worker"] will be updated in-place
~ resource "github_repository" "repository" {
      ~ delete_branch_on_merge      = true -> false
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "core-system.worker"
        name                        = "core-system.worker"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.repository["fetch-system.util"] will be updated in-place
~ resource "github_repository" "repository" {
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "fetch-system.util"
        name                        = "fetch-system.util"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.repository["fetch-system.worker"] will be updated in-place
~ resource "github_repository" "repository" {
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "fetch-system.worker"
        name                        = "fetch-system.worker"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.repository["hts-connector"] will be updated in-place
~ resource "github_repository" "repository" {
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "hts-connector"
        name                        = "hts-connector"
      - vulnerability_alerts        = true -> null
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.repository["infrastructure"] will be updated in-place
~ resource "github_repository" "repository" {
      ~ allow_merge_commit          = false -> true
      ~ delete_branch_on_merge      = true -> false
      - has_discussions             = true -> null
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "infrastructure"
        name                        = "infrastructure"
      - vulnerability_alerts        = true -> null
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository.repository["manifests"] will be updated in-place
~ resource "github_repository" "repository" {
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "manifests"
        name                        = "manifests"
      - vulnerability_alerts        = true -> null
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.harbor.harbor_retention_policy.fetch-system-retention will be updated in-place
~ resource "harbor_retention_policy" "fetch-system-retention" {
        id       = "/retentions/1"
        # (2 unchanged attributes hidden)

      ~ rule {
          ~ untagged_artifacts     = false -> true
            # (10 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 22 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 1 to add, 22 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
